# For имя_переменной in имя итерирукмого объекта
# Задача вывести фразу по символьно

name = "Привет, мир!"
for i in name:
#for i in range(1,11):
    print(i)
