# For имя_переменной in имя итерирукмого объекта
# Задача вывести фразу 10 раз Привет мир

name = "Привет, мир!"
#for i in name:
for i in range(1,11):
    print(name)

