#Даны два трехзначных числа. Найдите шестизначное число, образованное из двух данных чисел путем дописывания второго числа к первому справа.
x=int(input("введите трехзначное чилсо"))
y=int(input("введите второе трехзначное чилсо"))
print (x*1000+y)