#Задача: Пользователь вводит 2 числа, а система выводит сумму данных чисел
x = int(input("Введите 1 число: "))
y = int(input("Введите 2 число: "))

def sum (a,b):
    return a + b

print (sum(x,y) )

# vc kode не хочет отображатся данная задача, пишит ошибку, 1
# vc code ругался на руское название файла, после исправления на 
# англиский стало работать нормально